/*
 * eeprom.h
 *
 * Created: 2013-04-11 09:57:12
 *  Author: User
 */ 


#ifndef EEPROM_H_
#define EEPROM_H_

//******************************************************//
//**********************BIBLIOTEKI**********************//
//******************************************************//

#include <avr/io.h>                // dostep do rejestrów
#include <avr/interrupt.h>        // funkcje sei(), cli()
#include <util/delay.h>

//*****************************************************//
//**********************DEFINICJE**********************//
//*****************************************************//

//*****************************************************//
//**********************ZMIENNE************************//
//*****************************************************//

//*****************************************************//
//**********************FUNKCJE************************//
//*****************************************************//

void EEPROM_write(unsigned char,unsigned char);
unsigned char EEPROM_read(unsigned char );
void EEPROM_write_page(unsigned char, int *, int );
void EEPROM_read_page(unsigned char , int *, int );


#endif /* EEPROM_H_ */